Revit 2026 API

# PipeFittingAndAccessoryPressureDropUIData Class

---

The input and output data used by external UI servers for storing UI settings.

SystemObject Autodesk.Revit.UI.PlumbingPipeFittingAndAccessoryPressureDropUIData

**Namespace:** Autodesk.Revit.UI.Plumbing**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeFittingAndAccessoryPressureDropUIData : IDisposable
```
```vb
Public Class PipeFittingAndAccessoryPressureDropUIData
	Implements IDisposable
```
```cpp
public ref class PipeFittingAndAccessoryPressureDropUIData : IDisposable
```
```fsharp
type PipeFittingAndAccessoryPressureDropUIData =
    class
        interface IDisposable
    end
```

The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PipeFittingAndAccessoryPressureDropUIData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetUIDataItems | Gets all UI data items stored in the UI data. |
|  | GetUnits | Gets units. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Plumbing Namespace